#-------------------------------------------------------------------------------
# gnuplotの設定
#-------------------------------------------------------------------------------
reset
set nokey                # 凡例の非表示
set xrange[0:0.192]
set yrange[0:0.096]
set cbrange[0:120000]
set view equal xy
set view 0,0
set contour
set cntrparam levels incremental 0,2500,120000

set parametric

set term gif enhanced animate size 2048,2048     # 出力をgifアニメに設定
set output "re_102_256_512_karman_omp_press.gif" # 出力ファイル名の設定
#-------------------------------------------------------------------------------
# 変数の設定
#-------------------------------------------------------------------------------
n0 = 0    # ループ変数の初期値
n1 = 560   # ループ変数の最大値
dn = 5    # ループ変数の増加間隔
adj = 0.01	#ベクトルの長さ

#-------------------------------------------------------------------------------
# ループの開始
#-------------------------------------------------------------------------------
load "karman_press.plt" 
