#-------------------------------------------------------------------------------
# gnuplotの設定
#-------------------------------------------------------------------------------
reset
set nokey                # 凡例の非表示
set xrange[0:0.32]
set yrange[0:0.16]
set cbrange[0:0.4]
set pm3d
set view equal xy
set contour
set cntrparam levels incremental 0,0.01,0.2
set view 0,0

set parametric

set term gif enhanced animate size 2048,2048     # 出力をgifアニメに設定
set output "re_131_512_256_karman_omp_color.gif" # 出力ファイル名の設定
#-------------------------------------------------------------------------------
# 変数の設定
#-------------------------------------------------------------------------------
n0 = 0    # ループ変数の初期値
n1 = 1556   # ループ変数の最大値
dn = 5    # ループ変数の増加間隔
adj = 0.05	#ベクトルの長さ

#-------------------------------------------------------------------------------
# ループの開始
#-------------------------------------------------------------------------------
load "karman_color.plt" 
